       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-RECORD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NAME PIC X(20) VALUE "COBOL STUDENT".
       PROCEDURE DIVISION.
           DISPLAY "HELLO, " WS-NAME
           GOBACK.

